package ui

import (
	"cli/internal/config"
	"fmt"
)

func Poster() {
	fmt.Println(`
██████╗ ███████╗██╗   ██╗     ██████╗ ██╗     ██╗
██╔══██╗██╔════╝██║   ██║    ██╔════╝ ██║     ██║
██║  ██║█████╗  ██║   ██║    ██║      ██║     ██║
██║  ██║██╔══╝  ╚██╗ ██╔╝    ██║      ██║     ██║
██████╔╝███████╗ ╚████╔╝     ╚██████╗ ███████╗██║
╚═════╝ ╚══════╝  ╚═══╝       ╚═════╝ ╚══════╝╚═╝
`)

	fmt.Println("🚀 Welcome to DEV CLI")
	fmt.Printf("🔹 Current Model : %s\n", config.LlmClient.ModelName)
	fmt.Println("\n(Press Ctrl + C to exit)")
}
